<!-- <?php
$joke[] = '- Какой идеальный вес для тещи?
            - Два килограмма вместе с урной.';
$joke[] = '- Как подобрать неглупую, но недорогую девушку для бюджетной поездки на море?
- Сядьте на аллее около Университета и бросьте 10 рублей на асфальт. Та, которая подберет, соответствует заявленным критериям.';
$joke[] = 'Помню тот день, когда мы с тобой познакомились. Если бы у меня была машина времени, я бы села за руль и тебя ею переехала.';
$joke[] = 'После полета Гагарина в космос, в паспортный стол приходит еврей: - Здгавствуйте. - Здравствуйте. - Я таки хотел бы поменять фамилию. - А какая у вас фамилия? - Кацман. - А какую бы вы хотели? - Кацманавт';
$joke[] = '- Вас не узнать. - Что, хорошо выгляжу? - Да не в этом дело. Вы кто?';
$joke[] = 'Парня знакомят с будущей невестой. Спрашивают: — Нравится? — Да не знаю... Вот если бы разделась... Пошептались, уговорили. Девушка сняла одежду. — Ну как? — Нет, не подходит. — а в чем дело?! — Глаза у нее не ласковые... ';
$joke[] = 'Депутат Госдумы фракции "Единая Россия", голосовавший за повышение пенсионного возраста до 65 лет, умер в 63 года. анекдотов.nеt Держите меня семеро, а то я это прокомментирую.';
$joke[] = 'Что вам не следует говорить, если вы за рулем, а пассажир в салоне очень нервный: — Опять тормоз барахлит... — Странно: руль кручу в одну сторону, а машина заворачивает в другую... — Не надо было столько водки пить за завтраком... — Я одного милиционера сейчас сбил или обоих? — О! Опять машины стали раздваиваться! — Так красиво по сторонам, что даже вперед смотреть не хочется. — Подержи руль, пока я посплю. — Опять глючит! Слышишь музыку? Как — нет?!?! — Почему деревья растут посреди шоссе? — Ну что, полетаем?';
$joke[] = '— Папа, а ты еще вырастешь? — Нет, сынок. — А зачем ты тогда кушаешь? ';
$joke[] = 'В Китае запрещен Инстаграм, об этом известно всем, но не все знают, что запретили его отнюдь не власти КНР, а его создатели, Кевин и Майк. Они решили, что нефиг перегружать сервера ОДИНАКОВЫМИ фотографиями…';
$random_number = rand(0, count($joke) - 1);
echo ($joke[$random_number]);
// $file = file_get_contents('joke.txt');
// echo $file; -->
